In [ ]:
import pandas as pd

# Read a .csv from a URL with Pandas

Target website: https://raw.githubusercontent.com/datasets/population/master/data/population.csv

In [9]:
#reading 1 csv file from the website
df =pd.read_csv('https://raw.githubusercontent.com/datasets/population/master/data/population.csv')

In [10]:
df

      Country Name Country Code  Year       Value
0            Aruba          ABW  1960     54922.0
1            Aruba          ABW  1961     55578.0
2            Aruba          ABW  1962     56320.0
3            Aruba          ABW  1963     57002.0
4            Aruba          ABW  1964     57619.0
...            ...          ...   ...         ...
16925     Zimbabwe          ZWE  2019  15271368.0
16926     Zimbabwe          ZWE  2020  15526888.0
16927     Zimbabwe          ZWE  2021  15797210.0
16928     Zimbabwe          ZWE  2022  16069056.0
16929     Zimbabwe          ZWE  2023  16340822.0

[16930 rows x 4 columns]

In [11]:
df.head()

  Country Name Country Code  Year    Value
0        Aruba          ABW  1960  54922.0
1        Aruba          ABW  1961  55578.0
2        Aruba          ABW  1962  56320.0
3        Aruba          ABW  1963  57002.0
4        Aruba          ABW  1964  57619.0

In [16]:
# rename columns
df=df.rename(columns={'Value':'Population'})
df.head()

  Country Name Country Code  Year  Population
0        Aruba          ABW  1960     54922.0
1        Aruba          ABW  1961     55578.0
2        Aruba          ABW  1962     56320.0
3        Aruba          ABW  1963     57002.0
4        Aruba          ABW  1964     57619.0

# Read .csv from Multiple URLs with Pandas

https://raw.githubusercontent.com/mwaskom/seaborn-data/master/iris.csv

In [40]:
import pandas as pd
import zipfile
import io
import requests

In [43]:
df_iris = pd.read_csv("https://raw.githubusercontent.com/mwaskom/seaborn-data/master/iris.csv")
df_iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [44]:
urls = {
    "iris": "https://raw.githubusercontent.com/mwaskom/seaborn-data/master/iris.csv",
    "tips": "https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv",
    "penguins": "https://raw.githubusercontent.com/mwaskom/seaborn-data/master/penguins.csv"
}

In [45]:
frames = []

for name in urls:
    df = pd.read_csv(urls[name])
    df.insert(0, "dataset", name)   # add column to identify dataset
    frames.append(df)

len(frames)

3

In [46]:
frames[2].head(3)

,dataset,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,penguins,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,penguins,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,penguins,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE

In [47]:
#Combine multiple CSVs
df_all = pd.concat(frames, ignore_index=True)
df_all.head()

,dataset,sepal_length,sepal_width,petal_length,petal_width,species,total_bill,tip,sex,smoker,day,time,size,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g
0,iris,5.1,3.5,1.4,0.2,setosa,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,iris,4.9,3.0,1.4,0.2,setosa,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,iris,4.7,3.2,1.3,0.2,setosa,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,iris,4.6,3.1,1.5,0.2,setosa,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,iris,5.0,3.6,1.4,0.2,setosa,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN